Repository: bytehaendig/axytos_payment_jtl
Catalog: locale/*/*.po
Languages: de_de

source: Status data refreshed.
de_de: Statusdaten aktualisiert.

source: Order not found or not using Axytos payment method.
de_de: Bestellung nicht gefunden oder verwendet keine Axytos-Zahlungsmethode.

source: Successfully processed %d pending action(s).
de_de: %d ausstehende Aktion(en) erfolgreich verarbeitet.

source: %d action(s) failed processing.
de_de: %d Aktion(en) konnten nicht verarbeitet werden.

source: No pending actions found to process.
de_de: Keine ausstehenden Aktionen zum Verarbeiten gefunden.

source: Successfully retried %d broken action(s) for order #%d.
de_de: %d defekte Aktion(en) für Bestellung #%d erfolgreich wiederholt.

source: %d action(s) still failed for order #%d.
de_de: %d Aktion(en) für Bestellung #%d sind immer noch fehlgeschlagen.

source: Successfully removed broken action "%s" for order #%d.
de_de: Defekte Aktion "%s" für Bestellung #%d erfolgreich entfernt.

source: Action "%s" for order #%d could not be removed (may not be broken or not exist).
de_de: Aktion "%s" für Bestellung #%d konnte nicht entfernt werden (ist möglicherweise nicht defekt oder existiert nicht).

source: No stuck Axytos cron jobs found.
de_de: Keine hängenden Axytos Cron-Jobs gefunden.

source: Successfully reset %d stuck Axytos cron job(s).
de_de: %d hängende Axytos Cron-Job(s) erfolgreich zurückgesetzt.

source: Failed to reset any stuck cron jobs.
de_de: Fehler beim Zurücksetzen hängender Cron-Jobs.

source: Settings saved successfully.
de_de: Einstellungen erfolgreich gespeichert.

source: Secure webhook key generated successfully. Click "Save Settings" to store it.
de_de: Sicherer Webhook-Schlüssel erfolgreich generiert. Klicken Sie auf "Einstellungen speichern", um ihn zu speichern.

source: Webhook sent successfully
de_de: Webhook erfolgreich gesendet

source: Webhook failed with status: %s
de_de: Webhook fehlgeschlagen mit Status: %s

source: Response:
de_de: Antwort:

source: Webhook key must be configured before generating automation script.
de_de: Webhook-Schlüssel muss konfiguriert werden, bevor das Automatisierungsskript generiert wird.

source: Prerequisites validated successfully.
de_de: Voraussetzungen erfolgreich validiert.

source: Invoice data refreshed.
de_de: Rechnungsdaten aktualisiert.

source: Invoice number %s has been set for order %s
de_de: Rechnungsnummer %s wurde für Bestellung %s gesetzt

source: Invalid order ID or empty invoice number.
de_de: Ungültige Bestell-ID oder leere Rechnungsnummer.

source: CSV file structure is invalid. Please check the file format.
de_de: CSV-Dateistruktur ist ungültig. Bitte überprüfen Sie das Dateiformat.

source: CSV file is empty or could not be parsed.
de_de: CSV-Datei ist leer oder konnte nicht geparst werden.

source: Successfully processed %d invoice updates out of %d total rows.
de_de: %d Rechnungsupdates von insgesamt %d Zeilen erfolgreich verarbeitet.

source: %d rows failed to process. Check the details below.
de_de: %d Zeilen konnten nicht verarbeitet werden. Überprüfen Sie die Details unten.

source: Invoice number added successfully
de_de: Rechnungsnummer erfolgreich hinzugefügt

source: Order already has invoice number: %s
de_de: Bestellung hat bereits Rechnungsnummer: %s

source: Unknown error occurred
de_de: Unbekannter Fehler aufgetreten

source: Processing completed
de_de: Verarbeitung abgeschlossen

source: Error processing CSV file: %s
de_de: Fehler beim Verarbeiten der CSV-Datei: %s

source: No CSV file was uploaded or upload failed.
de_de: Keine CSV-Datei wurde hochgeladen oder Upload fehlgeschlagen.

source: Order not found.
de_de: Bestellung nicht gefunden.

source: Error setting invoice number: %s
de_de: Fehler beim Setzen der Rechnungsnummer: %s

source: This payment method can only be used with payment before order completion
de_de: Die Zahlungsart kann nur mit Zahlung vor Bestellabschluss verwendet werden

source: API Configuration
de_de: API Konfiguration

source: Used for communication between Axytos Payment plugin and the Axytos API.
de_de: Wird für die Kommunikation zwischen Axytos Payment Plugin und der Axytos API verwendet.

source: API Key:
de_de: API-Schlüssel:

source: Your API key will be encrypted before storing in the database.
de_de: Ihr API-Schlüssel wird vor dem Speichern in der Datenbank verschlüsselt.

source: Use Sandbox Mode
de_de: Sandbox-Modus verwenden

source: Enable this for testing.
de_de: Aktivieren Sie dies zum Testen.

source: Windows Automation
de_de: Windows Automatisierung

source: Configure webhook key and generate Windows batch scripts for automated invoice data synchronization.
de_de: Webhook-Schlüssel konfigurieren und Windows-Batch-Skripte für automatisierte Rechnungsdatensynchronisation generieren.

source: Webhook API Key:
de_de: Webhook API-Schlüssel:

source: Generate Secure Key
de_de: Sicheren Schlüssel generieren

source: Generate
de_de: Generieren

source: Your webhook API key will be encrypted before storing in the database.
de_de: Ihr Webhook-API-Schlüssel wird vor dem Speichern in der Datenbank verschlüsselt.

source: Schedule Time:
de_de: Zeitplan:

source: Generate Windows Script
de_de: Windows-Skript generieren

source: Time when the automation should run daily.
de_de: Zeitpunkt, zu dem die Automatisierung täglich ausgeführt werden soll.

source: How to Use:
de_de: Verwendung:

source: Download the generated batch script
de_de: Das generierte Batch-Skript herunterladen

source: Run the script as Administrator on your Windows system
de_de: Das Skript als Administrator auf Ihrem Windows-System ausführen

source: The script will install itself, create a scheduled task, and generate an uninstall script
de_de: Das Skript installiert sich selbst, erstellt eine geplante Aufgabe und generiert ein Deinstallationsskript

source: Automation will run daily at the specified time
de_de: Die Automatisierung wird täglich zur angegebenen Zeit ausgeführt

source: Check the log file for execution status
de_de: Überprüfen Sie die Protokolldatei auf den Ausführungsstatus

source: To remove the automation system, run the generated uninstall.bat script
de_de: Um das Automatisierungssystem zu entfernen, führen Sie das generierte uninstall.bat-Skript aus

source: Save Settings
de_de: Einstellungen speichern

source: Generating...
de_de: Generiere...

source: Generated!
de_de: Generiert!

source: Downloaded!
de_de: Heruntergeladen!

source: Error
de_de: Fehler

source: Error generating automation script. Please check your configuration and try again.
de_de: Fehler beim Generieren des Automatisierungsskripts. Bitte überprüfen Sie Ihre Konfiguration und versuchen Sie es erneut.

source: Last Run:
de_de: Letzte Ausführung:

source: Never
de_de: Nie

source: Next Run:
de_de: Nächste Ausführung:

source: Unknown
de_de: Unbekannt

source: Are you sure you want to reset stuck cron jobs? This will set their isRunning status to 0.
de_de: Sind Sie sicher, dass Sie hängende Cron-Jobs zurücksetzen möchten? Dies setzt ihren isRunning-Status auf 0.

source: Reset
de_de: Zurücksetzen

source: Total Orders
de_de: Gesamt Bestellungen

source: Orders with actions
de_de: Bestellungen mit Aktionen

source: Order ID/Number
de_de: Bestell-ID/-Nummer

source: Pending
de_de: Ausstehend

source: Actions waiting
de_de: Aktionen warten

source: Are you sure you want to process all pending actions?
de_de: Sind Sie sicher, dass Sie alle ausstehenden Aktionen verarbeiten möchten?

source: Process All
de_de: Alle verarbeiten

source: Broken
de_de: Defekt

source: Need attention
de_de: Benötigt Aufmerksamkeit

source: Order Details:
de_de: Bestelldetails:

source: Customer:
de_de: Kunde:

source: Total:
de_de: Gesamt:

source: Date:
de_de: Datum:

source: Actions Overview
de_de: Aktionsübersicht

source: log entry
de_de: Log-Eintrag

source: log entries
de_de: Log-Einträge

source: Detailed log entries for
de_de: Detaillierte Log-Einträge für

source: No actions found for this order
de_de: Keine Aktionen für diese Bestellung gefunden

source: Order Actions
de_de: Bestellaktionen

source: Are you sure you want to retry all broken actions for this order? This will attempt to process them immediately.
de_de: Sind Sie sicher, dass Sie alle defekten Aktionen für diese Bestellung erneut versuchen möchten? Dies wird versuchen, sie sofort zu verarbeiten.

source: Retry Broken Actions
de_de: Defekte Aktionen wiederholen

source: Remove Broken Action
de_de: Defekte Aktion entfernen

source: Orders with Pending and Broken Actions
de_de: Bestellungen mit ausstehenden und defekten Aktionen

source: Recent Orders
de_de: Aktuelle Bestellungen

source: Order Number
de_de: Bestellnummer

source: Customer
de_de: Kunde

source: Date
de_de: Datum

source: Total
de_de: Gesamt

source: Pending/Broken Actions
de_de: Ausstehende/defekte Aktionen

source: pending
de_de: ausstehend

source: Orders
de_de: Bestellungen

source: No orders found.
de_de: Keine Bestellungen gefunden.

source: Refresh Data
de_de: Daten aktualisieren

source: Processing Details
de_de: Verarbeitungsdetails

source: Successfully Processed
de_de: Erfolgreich verarbeitet

source: Order
de_de: Bestellung

source: Invoice
de_de: Rechnung

source: processed
de_de: verarbeitet

source: Skipped
de_de: Übersprungen

source: skipped
de_de: übersprungen

source: Failed to Process
de_de: Verarbeitung fehlgeschlagen

source: failed
de_de: fehlgeschlagen

source: No rows were processed.
de_de: Keine Zeilen wurden verarbeitet.

source: Upload Invoice CSV
de_de: Rechnungs-CSV hochladen

source: Select CSV File
de_de: CSV-Datei auswählen

source: Choose CSV file...
de_de: CSV-Datei auswählen...

source: Upload CSV
de_de: CSV hochladen

source: Select a CSV file containing invoice data
de_de: Wählen Sie eine CSV-Datei mit Rechnungsdaten aus

source: Shipped Orders Awaiting Invoice
de_de: Bestellungen ohne Rechnungsnummer

source: No orders awaiting invoice found
de_de: Keine Bestellungen gefunden, die auf Rechnung warten

source: Set Invoice Number
de_de: Rechnungsnummer setzen

source: Invoice Number
de_de: Rechnungsnummer

source: Enter invoice number
de_de: Rechnungsnummer eingeben

source: Cancel
de_de: Abbrechen
